pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr5043.h
/* RTCADOWDAY Control Bits */
#define DOW                              (0x0007)        /* Day of week (0 to 6) */
#define DOW_L                            (0x0007)
#define DOW0                             (0x0001)        /* Day of week (0 to 6) */
#define DOW0_L                           (0x0001)
#define DOW1                             (0x0002)        /* Day of week (0 to 6) */
#define DOW1_L                           (0x0002)
#define DOW2                             (0x0004)        /* Day of week (0 to 6) */
#define DOW2_L                           (0x0004)
#define DOWAE                            (0x0080)        /* Alarm enable */
#define DOWAE_L                          (0x0080)
#define DAYAE                            (0x8000)        /* Alarm enable */
#define DAYAE_H                          (0x0080)

/* RTCADOWDAY_BCD Control Bits */
#define DAY_LD                           (0x0f00)        /* Day of month  low digit (0 to 9) */
#define DAY_LD_H                         (0x000f)
#define DAY_LD0                          (0x0100)        /* Day of month  low digit (0 to 9) */
#define DAY_LD0_H                        (0x0001)
#define DAY_LD1                          (0x0200)        /* Day of month  low digit (0 to 9) */
#define DAY_LD1_H                        (0x0002)
#define DAY_LD2                          (0x0400)        /* Day of month  low digit (0 to 9) */
#define DAY_LD2_H                        (0x0004)
#define DAY_LD3                          (0x0800)        /* Day of month  low digit (0 to 9) */
#define DAY_LD3_H                        (0x0008)
#define DAY_HD                           (0x3000)        /* Day of month  high digit (0 to 3) */
#define DAY_HD_H                         (0x0030)
#define DAY_HD0                          (0x1000)        /* Day of month  high digit (0 to 3) */
#define DAY_HD0_H                        (0x0010)
#define DAY_HD1                          (0x2000)        /* Day of month  high digit (0 to 3) */
#define DAY_HD1_H                        (0x0020)


/*****************************************************************************
 SAPH_A Registers
*****************************************************************************/

#define __MSP430_HAS_SAPH_A__                 /* Definition to show that module is available */
#define __MSP430_BASEADDRESS_SAPH_A__ 0x0E00
#define SAPH_A_BASE            __MSP430_BASEADDRESS_SAPH_A__

sfr_w(SAPH_AIIDX);                            /* Interrupt Index */
sfr_b(SAPH_AIIDX_L);
sfr_b(SAPH_AIIDX_H);
sfr_w(SAPH_AMIS);                             /* Masked Interrupt Satus */
sfr_b(SAPH_AMIS_L);
sfr_b(SAPH_AMIS_H);
sfr_w(SAPH_ARIS);                             /* Raw Interrupt Status */
sfr_b(SAPH_ARIS_L);
sfr_b(SAPH_ARIS_H);
sfr_w(SAPH_AIMSC);                            /* Interrupt Mask */
sfr_b(SAPH_AIMSC_L);
sfr_b(SAPH_AIMSC_H);
sfr_w(SAPH_AICR);                             /* Interrupt Clear */
sfr_b(SAPH_AICR_L);
sfr_b(SAPH_AICR_H);
sfr_w(SAPH_AISR);                             /* Interrupt Set */
sfr_b(SAPH_AISR_L);
sfr_b(SAPH_AISR_H);
sfr_w(SAPH_ADESCLO);                          /* Module-Descriptor Low Word */
sfr_b(SAPH_ADESCLO_L);
sfr_b(SAPH_ADESCLO_H);
sfr_w(SAPH_ADESCHI);                          /* Module-Descriptor High Word */
sfr_b(SAPH_ADESCHI_L);
sfr_b(SAPH_ADESCHI_H);
sfr_w(SAPH_AKEY);                             /* Key */
sfr_b(SAPH_AKEY_L);
sfr_b(SAPH_AKEY_H);
sfr_w(SAPH_AOCTL0);                           /* Physical Interface Output Control #0 */
sfr_b(SAPH_AOCTL0_L);
sfr_b(SAPH_AOCTL0_H);
sfr_w(SAPH_AOCTL1);                           /* Physical Interface Output Control #1 */
sfr_b(SAPH_AOCTL1_L);
sfr_b(SAPH_AOCTL1_H);
sfr_w(SAPH_AOSEL);                            /* Physical Interface Output Function Select */
sfr_b(SAPH_AOSEL_L);
sfr_b(SAPH_AOSEL_H);
sfr_w(SAPH_ACH0PUT);                          /* Channel 0 Pull UpTrim Register */
sfr_b(SAPH_ACH0PUT_L);
sfr_b(SAPH_ACH0PUT_H);
sfr_w(SAPH_ACH0PDT);                          /* Channel 0 Pull DownTrim Register */
sfr_b(SAPH_ACH0PDT_L);
sfr_b(SAPH_ACH0PDT_H);
sfr_w(SAPH_ACH0TT);                           /* Channel 0 Termination Trim */
sfr_b(SAPH_ACH0TT_L);
sfr_b(SAPH_ACH0TT_H);
sfr_w(SAPH_ACH1PUT);                          /* Channel 1 Pull UpTrim */
sfr_b(SAPH_ACH1PUT_L);
sfr_b(SAPH_ACH1PUT_H);
sfr_w(SAPH_ACH1PDT);                          /* Channel 1 Pull DownTrim */
sfr_b(SAPH_ACH1PDT_L);
sfr_b(SAPH_ACH1PDT_H);
sfr_w(SAPH_ACH1TT);                           /* Channel 1 Termination Trim */
sfr_b(SAPH_ACH1TT_L);
sfr_b(SAPH_ACH1TT_H);
sfr_w(SAPH_AMCNF);                            /* Mode Configuration Register */
sfr_b(SAPH_AMCNF_L);
sfr_b(SAPH_AMCNF_H);
sfr_w(SAPH_ATACTL);                           /* Trim Access Control */
sfr_b(SAPH_ATACTL_L);
sfr_b(SAPH_ATACTL_H);
sfr_w(SAPH_AICTL0);                           /* Physical Interface Input Control #0 */
sfr_b(SAPH_AICTL0_L);
sfr_b(SAPH_AICTL0_H);
sfr_w(SAPH_ABCTL);                            /* Bias Control */
sfr_b(SAPH_ABCTL_L);
sfr_b(SAPH_ABCTL_H);
sfr_w(SAPH_APGC);                             /* PPG Count */
sfr_b(SAPH_APGC_L);
sfr_b(SAPH_APGC_H);
sfr_w(SAPH_APGLPER);                          /* Pulse Generator Low Period */
sfr_b(SAPH_APGLPER_L);
sfr_b(SAPH_APGLPER_H);
sfr_w(SAPH_APGHPER);                          /* Pulse Generator High Period */
sfr_b(SAPH_APGHPER_L);
sfr_b(SAPH_APGHPER_H);
sfr_w(SAPH_APGCTL);                           /* PPG Control */
sfr_b(SAPH_APGCTL_L);
sfr_b(SAPH_APGCTL_H);
sfr_w(SAPH_APPGTRIG);                         /* PPG Software Trigger */
sfr_b(SAPH_APPGTRIG_L);
sfr_b(SAPH_APPGTRIG_H);
sfr_w(SAPH_AXPGCTL);                          /* Extended Pulse Control Register */
sfr_b(SAPH_AXPGCTL_L);
sfr_b(SAPH_AXPGCTL_H);
sfr_w(SAPH_AXPGLPER);                         /* Extra Pulse Low Period Register */
sfr_b(SAPH_AXPGLPER_L);
sfr_b(SAPH_AXPGLPER_H);
sfr_w(SAPH_AXPGHPER);                         /* Extra Pulse High Period Register */
sfr_b(SAPH_AXPGHPER_L);
sfr_b(SAPH_AXPGHPER_H);
sfr_w(SAPH_AASCTL0);                          /* A-SEQ control register 0 */
sfr_b(SAPH_AASCTL0_L);
sfr_b(SAPH_AASCTL0_H);
sfr_w(SAPH_AASCTL1);                          /* A-SEQ control register 1 */
sfr_b(SAPH_AASCTL1_L);
sfr_b(SAPH_AASCTL1_H);
sfr_b(SAPH_AASQTRIG);                         /* ASQ Software Trigger */

sfr_w(SAPH_AAPOL);                            /* ASQ ping output polarity */
sfr_b(SAPH_AAPOL_L);
sfr_b(SAPH_AAPOL_H);
sfr_w(SAPH_AAPLEV);                           /* ASQ ping pause level */
sfr_b(SAPH_AAPLEV_L);
sfr_b(SAPH_AAPLEV_H);
sfr_w(SAPH_AAPHIZ);                           /* ASQ ping pause impedance */
sfr_b(SAPH_AAPHIZ_L);
sfr_b(SAPH_AAPHIZ_H);
sfr_w(SAPH_AATM_A);                           /* A-SEQ start to 1st ping */
sfr_b(SAPH_AATM_A_L);
sfr_b(SAPH_AATM_A_H);
sfr_w(SAPH_AATM_B);                           /* ASQ start to ADC arm */
sfr_b(SAPH_AATM_B_L);
sfr_b(SAPH_AATM_B_H);
sfr_w(SAPH_AATM_C);                           /* Count for the TIMEMARK C Event */
sfr_b(SAPH_AATM_C_L);
sfr_b(SAPH_AATM_C_H);
sfr_w(SAPH_AATM_D);                           /* ASQ start to ADC trig */
sfr_b(SAPH_AATM_D_L);
sfr_b(SAPH_AATM_D_H);
sfr_w(SAPH_AATM_E);                           /* ASQ start to restart */
sfr_b(SAPH_AATM_E_L);
sfr_b(SAPH_AATM_E_H);
sfr_w(SAPH_AATM_F);                           /* ASQ start to timeout */
sfr_b(SAPH_AATM_F_L);
sfr_b(SAPH_AATM_F_H);
sfr_w(SAPH_ATBCTL);                           /* Time Base Control */
sfr_b(SAPH_ATBCTL_L);
sfr_b(SAPH_ATBCTL_H);
sfr_w(SAPH_AATIMLO);                          /* Acquisition Timer Low Part */
sfr_b(SAPH_AATIMLO_L);
sfr_b(SAPH_AATIMLO_H);
sfr_w(SAPH_AATIMHI);                          /* Acquisition Timer High Part */
sfr_b(SAPH_AATIMHI_L);
sfr_b(SAPH_AATIMHI_H);

