pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr5043.h
/* SAPH_A Register Offsets */
#define OFS_SAPH_AIIDX                   (0x0000)
#define OFS_SAPH_AIIDX_L                 OFS_SAPH_AIIDX
#define OFS_SAPH_AIIDX_H                 OFS_SAPH_AIIDX+1
#define OFS_SAPH_AMIS                    (0x0002)
#define OFS_SAPH_AMIS_L                  OFS_SAPH_AMIS
#define OFS_SAPH_AMIS_H                  OFS_SAPH_AMIS+1
#define OFS_SAPH_ARIS                    (0x0004)
#define OFS_SAPH_ARIS_L                  OFS_SAPH_ARIS
#define OFS_SAPH_ARIS_H                  OFS_SAPH_ARIS+1
#define OFS_SAPH_AIMSC                   (0x0006)
#define OFS_SAPH_AIMSC_L                 OFS_SAPH_AIMSC
#define OFS_SAPH_AIMSC_H                 OFS_SAPH_AIMSC+1
#define OFS_SAPH_AICR                    (0x0008)
#define OFS_SAPH_AICR_L                  OFS_SAPH_AICR
#define OFS_SAPH_AICR_H                  OFS_SAPH_AICR+1
#define OFS_SAPH_AISR                    (0x000A)
#define OFS_SAPH_AISR_L                  OFS_SAPH_AISR
#define OFS_SAPH_AISR_H                  OFS_SAPH_AISR+1
#define OFS_SAPH_ADESCLO                 (0x000C)
#define OFS_SAPH_ADESCLO_L               OFS_SAPH_ADESCLO
#define OFS_SAPH_ADESCLO_H               OFS_SAPH_ADESCLO+1
#define OFS_SAPH_ADESCHI                 (0x000E)
#define OFS_SAPH_ADESCHI_L               OFS_SAPH_ADESCHI
#define OFS_SAPH_ADESCHI_H               OFS_SAPH_ADESCHI+1
#define OFS_SAPH_AKEY                    (0x0010)
#define OFS_SAPH_AKEY_L                  OFS_SAPH_AKEY
#define OFS_SAPH_AKEY_H                  OFS_SAPH_AKEY+1
#define OFS_SAPH_AOCTL0                  (0x0012)
#define OFS_SAPH_AOCTL0_L                OFS_SAPH_AOCTL0
#define OFS_SAPH_AOCTL0_H                OFS_SAPH_AOCTL0+1
#define OFS_SAPH_AOCTL1                  (0x0014)
#define OFS_SAPH_AOCTL1_L                OFS_SAPH_AOCTL1
#define OFS_SAPH_AOCTL1_H                OFS_SAPH_AOCTL1+1
#define OFS_SAPH_AOSEL                   (0x0016)
#define OFS_SAPH_AOSEL_L                 OFS_SAPH_AOSEL
#define OFS_SAPH_AOSEL_H                 OFS_SAPH_AOSEL+1
#define OFS_SAPH_ACH0PUT                 (0x0020)
#define OFS_SAPH_ACH0PUT_L               OFS_SAPH_ACH0PUT
#define OFS_SAPH_ACH0PUT_H               OFS_SAPH_ACH0PUT+1
#define OFS_SAPH_ACH0PDT                 (0x0022)
#define OFS_SAPH_ACH0PDT_L               OFS_SAPH_ACH0PDT
#define OFS_SAPH_ACH0PDT_H               OFS_SAPH_ACH0PDT+1
#define OFS_SAPH_ACH0TT                  (0x0024)
#define OFS_SAPH_ACH0TT_L                OFS_SAPH_ACH0TT
#define OFS_SAPH_ACH0TT_H                OFS_SAPH_ACH0TT+1
#define OFS_SAPH_ACH1PUT                 (0x0026)
#define OFS_SAPH_ACH1PUT_L               OFS_SAPH_ACH1PUT
#define OFS_SAPH_ACH1PUT_H               OFS_SAPH_ACH1PUT+1
#define OFS_SAPH_ACH1PDT                 (0x0028)
#define OFS_SAPH_ACH1PDT_L               OFS_SAPH_ACH1PDT
#define OFS_SAPH_ACH1PDT_H               OFS_SAPH_ACH1PDT+1
#define OFS_SAPH_ACH1TT                  (0x002A)
#define OFS_SAPH_ACH1TT_L                OFS_SAPH_ACH1TT
#define OFS_SAPH_ACH1TT_H                OFS_SAPH_ACH1TT+1
#define OFS_SAPH_AMCNF                   (0x002C)
#define OFS_SAPH_AMCNF_L                 OFS_SAPH_AMCNF
#define OFS_SAPH_AMCNF_H                 OFS_SAPH_AMCNF+1
#define OFS_SAPH_ATACTL                  (0x002E)
#define OFS_SAPH_ATACTL_L                OFS_SAPH_ATACTL
#define OFS_SAPH_ATACTL_H                OFS_SAPH_ATACTL+1
#define OFS_SAPH_AICTL0                  (0x0030)
#define OFS_SAPH_AICTL0_L                OFS_SAPH_AICTL0
#define OFS_SAPH_AICTL0_H                OFS_SAPH_AICTL0+1
#define OFS_SAPH_ABCTL                   (0x0034)
#define OFS_SAPH_ABCTL_L                 OFS_SAPH_ABCTL
#define OFS_SAPH_ABCTL_H                 OFS_SAPH_ABCTL+1
#define OFS_SAPH_APGC                    (0x0040)
#define OFS_SAPH_APGC_L                  OFS_SAPH_APGC
#define OFS_SAPH_APGC_H                  OFS_SAPH_APGC+1
#define OFS_SAPH_APGLPER                 (0x0042)
#define OFS_SAPH_APGLPER_L               OFS_SAPH_APGLPER
#define OFS_SAPH_APGLPER_H               OFS_SAPH_APGLPER+1
#define OFS_SAPH_APGHPER                 (0x0044)
#define OFS_SAPH_APGHPER_L               OFS_SAPH_APGHPER
#define OFS_SAPH_APGHPER_H               OFS_SAPH_APGHPER+1
#define OFS_SAPH_APGCTL                  (0x0046)
#define OFS_SAPH_APGCTL_L                OFS_SAPH_APGCTL
#define OFS_SAPH_APGCTL_H                OFS_SAPH_APGCTL+1
#define OFS_SAPH_APPGTRIG                (0x0048)
#define OFS_SAPH_APPGTRIG_L              OFS_SAPH_APPGTRIG
#define OFS_SAPH_APPGTRIG_H              OFS_SAPH_APPGTRIG+1
#define OFS_SAPH_AXPGCTL                 (0x004A)
#define OFS_SAPH_AXPGCTL_L               OFS_SAPH_AXPGCTL
#define OFS_SAPH_AXPGCTL_H               OFS_SAPH_AXPGCTL+1
#define OFS_SAPH_AXPGLPER                (0x004C)
#define OFS_SAPH_AXPGLPER_L              OFS_SAPH_AXPGLPER
#define OFS_SAPH_AXPGLPER_H              OFS_SAPH_AXPGLPER+1
#define OFS_SAPH_AXPGHPER                (0x004E)
#define OFS_SAPH_AXPGHPER_L              OFS_SAPH_AXPGHPER
#define OFS_SAPH_AXPGHPER_H              OFS_SAPH_AXPGHPER+1
#define OFS_SAPH_AASCTL0                 (0x0060)
#define OFS_SAPH_AASCTL0_L               OFS_SAPH_AASCTL0
#define OFS_SAPH_AASCTL0_H               OFS_SAPH_AASCTL0+1
#define OFS_SAPH_AASCTL1                 (0x0062)
#define OFS_SAPH_AASCTL1_L               OFS_SAPH_AASCTL1
#define OFS_SAPH_AASCTL1_H               OFS_SAPH_AASCTL1+1
#define OFS_SAPH_AASQTRIG                (0x0064)
#define OFS_SAPH_AAPOL                   (0x0066)
#define OFS_SAPH_AAPOL_L                 OFS_SAPH_AAPOL
#define OFS_SAPH_AAPOL_H                 OFS_SAPH_AAPOL+1
#define OFS_SAPH_AAPLEV                  (0x0068)
#define OFS_SAPH_AAPLEV_L                OFS_SAPH_AAPLEV
#define OFS_SAPH_AAPLEV_H                OFS_SAPH_AAPLEV+1
#define OFS_SAPH_AAPHIZ                  (0x006A)
#define OFS_SAPH_AAPHIZ_L                OFS_SAPH_AAPHIZ
#define OFS_SAPH_AAPHIZ_H                OFS_SAPH_AAPHIZ+1
#define OFS_SAPH_AATM_A                  (0x006E)
#define OFS_SAPH_AATM_A_L                OFS_SAPH_AATM_A
#define OFS_SAPH_AATM_A_H                OFS_SAPH_AATM_A+1
#define OFS_SAPH_AATM_B                  (0x0070)
#define OFS_SAPH_AATM_B_L                OFS_SAPH_AATM_B
#define OFS_SAPH_AATM_B_H                OFS_SAPH_AATM_B+1
#define OFS_SAPH_AATM_C                  (0x0072)
#define OFS_SAPH_AATM_C_L                OFS_SAPH_AATM_C
#define OFS_SAPH_AATM_C_H                OFS_SAPH_AATM_C+1
#define OFS_SAPH_AATM_D                  (0x0074)
#define OFS_SAPH_AATM_D_L                OFS_SAPH_AATM_D
#define OFS_SAPH_AATM_D_H                OFS_SAPH_AATM_D+1
#define OFS_SAPH_AATM_E                  (0x0076)
#define OFS_SAPH_AATM_E_L                OFS_SAPH_AATM_E
#define OFS_SAPH_AATM_E_H                OFS_SAPH_AATM_E+1
#define OFS_SAPH_AATM_F                  (0x0078)
#define OFS_SAPH_AATM_F_L                OFS_SAPH_AATM_F
#define OFS_SAPH_AATM_F_H                OFS_SAPH_AATM_F+1
#define OFS_SAPH_ATBCTL                  (0x007A)
#define OFS_SAPH_ATBCTL_L                OFS_SAPH_ATBCTL
#define OFS_SAPH_ATBCTL_H                OFS_SAPH_ATBCTL+1
#define OFS_SAPH_AATIMLO                 (0x007C)
#define OFS_SAPH_AATIMLO_L               OFS_SAPH_AATIMLO
#define OFS_SAPH_AATIMLO_H               OFS_SAPH_AATIMLO+1
#define OFS_SAPH_AATIMHI                 (0x007E)
#define OFS_SAPH_AATIMHI_L               OFS_SAPH_AATIMHI
#define OFS_SAPH_AATIMHI_H               OFS_SAPH_AATIMHI+1

/* SAPH_A Control Bits */

/* SAPH_AIIDX Control Bits */
#define IIDX_3                           (0x0006)        /* This interrupt is valid when ASQ is activcve (auto mode). The 
                                                            interrupt occurs when ASQ completes all of the measurements 
                                                            programmed in ASCTL0.PNGCNT. For example, when ASCTL0.PNGCNT =
                                                            3, total four measurements are performed. The interrupt 
                                                            indicates that all of the four measurements have been 
                                                            completed. */
#define IIDX_3_L                         (0x0006)
#define IIDX_4                           (0x0008)        /* This interrupt is valid when ASQ is active (auto mode). The 
                                                            interrupt occurs when ASQ completes one measurement sequence. 
                                                            For example, when ASCTL0.PNGCNT = 3, total four measurements 
                                                            are performed. The interrupt indicates that one measurement 
                                                            has been completed. */
#define IIDX_4_L                         (0x0008)
#define IIDX__NONE                       (0x0000)        /* no interrupts pending */
#define IIDX__DATAERR                    (0x0002)        /* This interrupt indicates that either WINHI interrupt or WINLO 
                                                            interrupt has occurred in SDHS. */
#define IIDX__DATAERR_L                  (0x0002)
#define IIDX__TMFTO                      (0x0004)        /* This interrupt is valid when ASQ is activcve (auto mode). The 
                                                            interrupt indicates that the time counter in ASQ has reached 
                                                            to TIMEMARK_F (timeout). */
#define IIDX__TMFTO_L                    (0x0004)
#define IIDX__SEQDN                      (0x0006)        /* This interrupt is valid when ASQ is activcve (auto mode). The 
                                                            interrupt occurs when ASQ completes all of the measurements 
                                                            programmed in ASCTL0.PNGCNT. For example, when ASCTL0.PNGCNT =
                                                            3, total four measurements are performed. The interrupt 
                                                            indicates that all of the four measurements have been 
                                                            completed. */
#define IIDX__SEQDN_L                    (0x0006)
#define IIDX__PNGDN                      (0x0008)        /* This interrupt is valid when ASQ is active (auto mode). The 
                                                            interrupt occurs when ASQ completes one measurement sequence. 
                                                            For example, when ASCTL0.PNGCNT = 3, total four measurements 
                                                            are performed. The interrupt indicates that one measurement 
                                                            has been completed. */
#define IIDX__PNGDN_L                    (0x0008)

