pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr5043.h
/* SAPH_AXPGCTL Control Bits */
#define XPULS                            (0x007f)        /* */
#define XPULS_L                          (0x007f)
#define XPULS0                           (0x0001)        /* */
#define XPULS0_L                         (0x0001)
#define XPULS1                           (0x0002)        /* */
#define XPULS1_L                         (0x0002)
#define XPULS2                           (0x0004)        /* */
#define XPULS2_L                         (0x0004)
#define XPULS3                           (0x0008)        /* */
#define XPULS3_L                         (0x0008)
#define XPULS4                           (0x0010)        /* */
#define XPULS4_L                         (0x0010)
#define XPULS5                           (0x0020)        /* */
#define XPULS5_L                         (0x0020)
#define XPULS6                           (0x0040)        /* */
#define XPULS6_L                         (0x0040)
#define XSTAT                            (0x0300)        /* */
#define XSTAT_H                          (0x0003)
#define XSTAT0                           (0x0100)        /* */
#define XSTAT0_H                         (0x0001)
#define XSTAT1                           (0x0200)        /* */
#define XSTAT1_H                         (0x0002)
#define XSTAT_0                          (0x0000)        /* PPG in Pause Phase */
#define XSTAT_1                          (0x0100)        /* PPG in Stop Phase */
#define XSTAT_1_H                        (0x0001)
#define XSTAT_2                          (0x0200)        /* PPG in Regular Excitation phase */
#define XSTAT_2_H                        (0x0002)
#define XSTAT_3                          (0x0300)        /* PPG in Extra Excitation Phase */
#define XSTAT_3_H                        (0x0003)
#define XMOD                             (0x3000)        /* */
#define XMOD_H                           (0x0030)
#define XMOD0                            (0x1000)        /* */
#define XMOD0_H                          (0x0010)
#define XMOD1                            (0x2000)        /* */
#define XMOD1_H                          (0x0020)
#define XMOD_0                           (0x0000)        /* Single tone generation (Pause-E-S-Pause) */
#define XMOD_1                           (0x1000)        /* reserved */
#define XMOD_1_H                         (0x0010)
#define XMOD_2                           (0x2000)        /* Dual Tone Generation (Pause-X-E-S-Pause) */
#define XMOD_2_H                         (0x0020)
#define XMOD_3                           (0x3000)        /* Dual Tone Loop (X-E-X-E triggers events) */
#define XMOD_3_H                         (0x0030)
#define ETY                              (0x4000)        /* */
#define ETY_H                            (0x0040)
#define ETY_0                            (0x0000)        /* Timer count event */
#define ETY_1                            (0x4000)        /* DMA trigger event */
#define ETY_1_H                          (0x0040)

/* SAPH_AXPGLPER Control Bits */
#define XLPER                            (0x00ff)        /* */
#define XLPER_L                          (0x00ff)
#define XLPER0                           (0x0001)        /* */
#define XLPER0_L                         (0x0001)
#define XLPER1                           (0x0002)        /* */
#define XLPER1_L                         (0x0002)
#define XLPER2                           (0x0004)        /* */
#define XLPER2_L                         (0x0004)
#define XLPER3                           (0x0008)        /* */
#define XLPER3_L                         (0x0008)
#define XLPER4                           (0x0010)        /* */
#define XLPER4_L                         (0x0010)
#define XLPER5                           (0x0020)        /* */
#define XLPER5_L                         (0x0020)
#define XLPER6                           (0x0040)        /* */
#define XLPER6_L                         (0x0040)
#define XLPER7                           (0x0080)        /* */
#define XLPER7_L                         (0x0080)

/* SAPH_AXPGHPER Control Bits */
#define XHPER                            (0x00ff)        /* */
#define XHPER_L                          (0x00ff)
#define XHPER0                           (0x0001)        /* */
#define XHPER0_L                         (0x0001)
#define XHPER1                           (0x0002)        /* */
#define XHPER1_L                         (0x0002)
#define XHPER2                           (0x0004)        /* */
#define XHPER2_L                         (0x0004)
#define XHPER3                           (0x0008)        /* */
#define XHPER3_L                         (0x0008)
#define XHPER4                           (0x0010)        /* */
#define XHPER4_L                         (0x0010)
#define XHPER5                           (0x0020)        /* */
#define XHPER5_L                         (0x0020)
#define XHPER6                           (0x0040)        /* */
#define XHPER6_L                         (0x0040)
#define XHPER7                           (0x0080)        /* */
#define XHPER7_L                         (0x0080)

/* SAPH_AASCTL0 Control Bits */
#define PNGCNT                           (0x0003)        /* */
#define PNGCNT_L                         (0x0003)
#define PNGCNT0                          (0x0001)        /* */
#define PNGCNT0_L                        (0x0001)
#define PNGCNT1                          (0x0002)        /* */
#define PNGCNT1_L                        (0x0002)
#define ASQCHSEL                         (0x0010)        /* */
#define ASQCHSEL_L                       (0x0010)
#define ASQCHSEL_0                       (0x0000)        /* CH0 is selected to start with.  If ASCTL0.PNGCNT = 3 and 
                                                            ASCTL1.CHTOG =1, then the channel selection would be CH0 -> 
                                                            CH1 -> CH0 -> CH1. If ASCTL0.PNGCNT = 3 and ASCTL1.CHTOG =0, 
                                                            then the channel selection would be CH0 -> CH0 -> CH0 -> CH0. */
#define ASQCHSEL_1                       (0x0010)        /* CH1 is selected to start with.  If ASCTL0.PNGCNT = 3 and 
                                                            ASCTL1.CHTOG =0, then the channel selection would be CH1 -> 
                                                            CH1 -> CH1 -> CH1. If ASCTL0.PNGCNT = 3 and ASCTL1.CHTOG =1, 
                                                            then the channel selection would be CH1 -> CH0 -> CH1 -> CH0. */
#define ASQCHSEL_1_L                     (0x0010)
#define ASQSTOP                          (0x0080)        /* */
#define ASQSTOP_L                        (0x0080)
#define ASQTEN                           (0x0200)        /* */
#define ASQTEN_H                         (0x0002)
#define ASQEN_0                          (0x0000)        /* ASQ trigger is disabled. */
#define ASQEN_1                          (0x0200)        /* ASQ trigger is enabled. */
#define ASQEN_1_H                        (0x0002)
#define TRIGSEL                          (0x0c00)        /* */
#define TRIGSEL_H                        (0x000c)
#define TRIGSEL0                         (0x0400)        /* */
#define TRIGSEL0_H                       (0x0004)
#define TRIGSEL1                         (0x0800)        /* */
#define TRIGSEL1_H                       (0x0008)
#define TRIGSEL_0                        (0x0000)        /* Writing '1' to ASQTRIG.ASQTRIG */
#define TRIGSEL_1                        (0x0400)        /* The PSQ is selected to start the ASQ. */
#define TRIGSEL_1_H                      (0x0004)
#define TRIGSEL_2                        (0x0800)        /* Ext. Signal (See device specific datasheet) */
#define TRIGSEL_2_H                      (0x0008)
#define TRIGSEL_3                        (0x0c00)        /* Ext. Signal (See device specific datasheet) */
#define TRIGSEL_3_H                      (0x000c)
#define TRIGSEL__SWTRIG                  (0x0000)        /* Writing '1' to ASQTRIG.ASQTRIG */
#define TRIGSEL__PSQ                     (0x0400)        /* The PSQ is selected to start the ASQ. */
#define TRIGSEL__PSQ_H                   (0x0004)
#define TRIGSEL__TIMER                   (0x0800)        /* Ext. Signal (See device specific datasheet) */
#define TRIGSEL__TIMER_H                 (0x0008)
#define ERABRT                           (0x2000)        /* */
#define ERABRT_H                         (0x0020)
#define ERABRT_0                         (0x0000)        /* Continue the measurements until completion regardless of the 
                                                            DATAERR interrupt. */
#define ERABRT_1                         (0x2000)        /* Stop the ASQ upon the DATAERR interrupt. */
#define ERABRT_1_H                       (0x0020)

