pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr5043.h
/* SAPH_AASCTL1 Control Bits */
#define CHTOG                            (0x0001)        /* */
#define CHTOG_L                          (0x0001)
#define CHTOG_0                          (0x0000)        /* Channel toggle is disabled. */
#define CHTOG_1                          (0x0001)        /* Channel toggle is enabled at each PNGDN interrupt. */
#define CHTOG_1_L                        (0x0001)
#define CHACT                            (0x0010)        /* */
#define CHACT_L                          (0x0010)
#define EARLYRB                          (0x0080)        /* */
#define EARLYRB_L                        (0x0080)
#define EARLYRB_0                        (0x0000)        /* Rx bias is applied to the Rx channel by the TIMEMARK C */
#define EARLYRB_1                        (0x0080)        /* Rx bias is applied to the Rx channel by the TIMEMARK A */
#define EARLYRB_1_L                      (0x0080)
#define ESOFF                            (0x0100)        /* */
#define ESOFF_H                          (0x0001)
#define ESOFF_0                          (0x0000)        /* OFF request is disabled. The ASQ does not send a request about
                                                            USS power mode to the PSQ. */
#define ESOFF_1                          (0x0100)        /* OFF request is generated after sequence */
#define ESOFF_1_H                        (0x0001)
#define STDBY                            (0x0400)        /* */
#define STDBY_H                          (0x0004)
#define STDBY_0                          (0x0000)        /* The ASQ sends a power down request to the PSQ (Power 
                                                            Sequencer) when the OFF request is received. */
#define STDBY_1                          (0x0400)        /* The ASQ sends a standby request to the PSQ (Power Sequencer) 
                                                            when the OFF request is received. */
#define STDBY_1_H                        (0x0004)
#define STDBY__PWROFF                    (0x0000)        /* The ASQ sends a power down request to the PSQ (Power 
                                                            Sequencer) when the OFF request is received. */
#define STDBY__STDBY                     (0x0400)        /* The ASQ sends a standby request to the PSQ (Power Sequencer) 
                                                            when the OFF request is received. */
#define STDBY__STDBY_H                   (0x0004)
#define CHOWN                            (0x0800)        /* */
#define CHOWN_H                          (0x0008)
#define CHOWN_0                          (0x0000)        /* Tx channel and Rx channel are not the same (This is the 
                                                            typical configuration). */
#define CHOWN_1                          (0x0800)        /* Tx channel and Rx channel are identical. */
#define CHOWN_1_H                        (0x0008)

/* SAPH_AASQTRIG Control Bits */
#define ASQTRIG                          (0x0001)        /* */
#define ASQTRIG_L                        (0x0001)

/* SAPH_AAPOL Control Bits */
#define PCPOL                            (0x000f)        /* */
#define PCPOL_L                          (0x000f)
#define PCPOL0                           (0x0001)        /* */
#define PCPOL0_L                         (0x0001)
#define PCPOL1                           (0x0002)        /* */
#define PCPOL1_L                         (0x0002)
#define PCPOL2                           (0x0004)        /* */
#define PCPOL2_L                         (0x0004)
#define PCPOL3                           (0x0008)        /* */
#define PCPOL3_L                         (0x0008)

/* SAPH_AAPLEV Control Bits */
#define PCPLEV                           (0x000f)        /* */
#define PCPLEV_L                         (0x000f)
#define PCPLEV0                          (0x0001)        /* */
#define PCPLEV0_L                        (0x0001)
#define PCPLEV1                          (0x0002)        /* */
#define PCPLEV1_L                        (0x0002)
#define PCPLEV2                          (0x0004)        /* */
#define PCPLEV2_L                        (0x0004)
#define PCPLEV3                          (0x0008)        /* */
#define PCPLEV3_L                        (0x0008)

/* SAPH_AAPHIZ Control Bits */
#define PCPHIZ                           (0x000f)        /* */
#define PCPHIZ_L                         (0x000f)
#define PCPHIZ0                          (0x0001)        /* */
#define PCPHIZ0_L                        (0x0001)
#define PCPHIZ1                          (0x0002)        /* */
#define PCPHIZ1_L                        (0x0002)
#define PCPHIZ2                          (0x0004)        /* */
#define PCPHIZ2_L                        (0x0004)
#define PCPHIZ3                          (0x0008)        /* */
#define PCPHIZ3_L                        (0x0008)

/* SAPH_AATM_A Control Bits */
#define TIMEMARK_A                       (0xffff)        /* */
#define TIMEMARK_A_L                     (0x00ff)
#define TIMEMARK_A_H                     (0x00ff)
#define TIMEMARK_A0                      (0x0001)        /* */
#define TIMEMARK_A0_L                    (0x0001)
#define TIMEMARK_A1                      (0x0002)        /* */
#define TIMEMARK_A1_L                    (0x0002)
#define TIMEMARK_A2                      (0x0004)        /* */
#define TIMEMARK_A2_L                    (0x0004)
#define TIMEMARK_A3                      (0x0008)        /* */
#define TIMEMARK_A3_L                    (0x0008)
#define TIMEMARK_A4                      (0x0010)        /* */
#define TIMEMARK_A4_L                    (0x0010)
#define TIMEMARK_A5                      (0x0020)        /* */
#define TIMEMARK_A5_L                    (0x0020)
#define TIMEMARK_A6                      (0x0040)        /* */
#define TIMEMARK_A6_L                    (0x0040)
#define TIMEMARK_A7                      (0x0080)        /* */
#define TIMEMARK_A7_L                    (0x0080)
#define TIMEMARK_A8                      (0x0100)        /* */
#define TIMEMARK_A8_H                    (0x0001)
#define TIMEMARK_A9                      (0x0200)        /* */
#define TIMEMARK_A9_H                    (0x0002)
#define TIMEMARK_A10                     (0x0400)        /* */
#define TIMEMARK_A10_H                   (0x0004)
#define TIMEMARK_A11                     (0x0800)        /* */
#define TIMEMARK_A11_H                   (0x0008)
#define TIMEMARK_A12                     (0x1000)        /* */
#define TIMEMARK_A12_H                   (0x0010)
#define TIMEMARK_A13                     (0x2000)        /* */
#define TIMEMARK_A13_H                   (0x0020)
#define TIMEMARK_A14                     (0x4000)        /* */
#define TIMEMARK_A14_H                   (0x0040)
#define TIMEMARK_A15                     (0x8000)        /* */
#define TIMEMARK_A15_H                   (0x0080)

